#pragma once


#define Table92Max 15

namespace CBITable
{
#define MaxHeaders 31
#define MaxHeaders92 Table92Max

	enum Headers //表头
	{
		unKnow = 0,
		进路类型 = 1,
		进路号码_首 = 2,
		进路 = 3,
		进路方式 = 4,
		排列按钮 = 5,
		确定方向道岔 = 6,
		信号机_名称 = 7,
		信号机_显示 = 8,
		信号机_表示器 = 9,
		道岔_混合 = 10,
		敌对信号 = 11,
		轨道区段_混合 = 12,
		敌对_迎面列车 = 13,
		敌对_迎面调车 = 14,
		其他联锁 = 15,

		敌对_局部信号 = 16,
		敌对_局部方式 = 17,
		非进路调车 = 18,
		进路号码_尾 = 19,

		道岔_防护 = 20,
		道岔_进路内 = 21,
		轨道区段_进路内 = 22,
		轨道区段_超限 = 23,

		信号机_灭灯显示 = 24,
		信号机_人解时间 = 25,
		接近锁闭_直向 = 26,
		接近锁闭_侧向 = 27,
		其他联锁_点灯 = 28,
		其他联锁_灭灯 = 29,
		CTCS等级 = 30

	};

	const std::string HeadersChinese[MaxHeaders] = {
		"未知",
		"进路类型",
		"进路号码_首",
		"进路",
		"进路方式",
		"排列按钮",
		"确定方向道岔",
		"信号机_名称",
		"信号机_显示",
		"信号机_表示器",
		"道岔_混合",
		"敌对信号",
		"轨道区段_混合",
		"敌对_迎面列车",
		"敌对_迎面调车",
		"其他联锁",
		"敌对_局部信号",
		"敌对_局部方式",
		"非进路调车",
		"进路号码_尾",
		"道岔_防护",
		"道岔_进路内",
		"轨道区段_进路内",
		"轨道区段_超限",
		"信号机_灭灯显示",
		"信号机_人解时间",
		"接近锁闭_直向",
		"接近锁闭_侧向",
		"其他联锁_点灯",
		"其他联锁_灭灯",
		"CTCS等级"

	};

	const int Header92[Table92Max + 1] = {-1,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14};  //从枚举类型对换到输出表格

	const int Header92Plus[20] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,16,17,15,18,19};
	const int Header18[20] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,16,17,15,18,19};

	//对换向量表
	const int Header2Excel1992[MaxHeaders]={0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};  //对换表
	const int Header2Excel2018[MaxHeaders]={0,1,2,3,4,5,0,6,7,8,0,13,0,18,19,0,0,0,0,0,12,11,14,15,9,10,16,17,20,21,22};  //对换表



	
}







